In [1]:
import pandas as pd
import numpy as np

In [2]:
def get_dataframe(csv_file="titanic_train.csv"):
    return pd.read_csv(csv_file)

df = get_dataframe()
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
def get_age_class_sex():
    df = get_dataframe()
    return df[["Pclass", "Sex", "Age"]]

df = get_age_class_sex()
df.head()

   Pclass     Sex   Age
0       3    male  22.0
1       1  female  38.0
2       3  female  26.0
3       1  female  35.0
4       3    male  35.0

In [4]:
def get_age_class_sex_over_30():
    df = get_dataframe()
    df = df[["Pclass", "Sex", "Age"]]
    return df[df["Age"] > 30]

df = get_age_class_sex_over_30()
df.head()

    Pclass     Sex   Age
1        1  female  38.0
3        1  female  35.0
4        3    male  35.0
6        1    male  54.0
11       1  female  58.0

In [5]:
df = pd.read_csv("titanic_train.csv")
df["Age"][3]

35.0

In [6]:
df["Age"].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [7]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
print(df.loc[[1,3], ["Age", "Pclass"]])
print("\n")
print(df.iloc[[1,3], [5,2]])

    Age  Pclass
1  38.0       1
3  35.0       1


    Age  Pclass
1  38.0       1
3  35.0       1

In [9]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [10]:
print(df.iloc[0])
print("\n")
print(df.loc[0])

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object


PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [11]:
def get_100th_person_info(index):
    df = get_dataframe()
    return df.loc[index]

df = get_100th_person_info(99)
df

PassengerId                  100
Survived                       0
Pclass                         2
Name           Kantor, Mr. Sinai
Sex                         male
Age                         34.0
SibSp                          1
Parch                          0
Ticket                    244367
Fare                        26.0
Cabin                        NaN
Embarked                       S
Name: 99, dtype: object

In [12]:
def calc_num_unique_ages():
    df = get_dataframe()
    return len(df["Age"].unique())

print(calc_num_unique_ages())
df = pd.read_csv("titanic_train.csv")
print(type(df["Age"]))

89
<class 'pandas.core.series.Series'>

In [13]:
def get_cabin_nulls_and_shape():
    df = pd.read_csv("titanic_train.csv")
    num_nulls = df["Cabin"].isna().sum()
    num_rows = len(df.index) # Equivalent: df.shape[0]
    return num_nulls, num_rows

num_nulls, num_rows = get_cabin_nulls_and_shape()
print(num_nulls)
print(num_rows)

687
891

In [14]:
def drop_cabin_col():
    df = pd.read_csv("titanic_train.csv")
    return df.drop(columns=["Cabin"])

drop_cabin_col().head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [15]:
df = pd.read_csv("titanic_train.csv")
classes = df["Pclass"].unique()
print(df[df["Survived"]==1].groupby(["Pclass"])["Survived"].count())
print(df[df["Survived"]==0].groupby(["Pclass"])["Survived"].count())
df["Survived"].count()

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64
Pclass
1     80
2     97
3    372
Name: Survived, dtype: int64

891

In [18]:
def survived_within_class():
    df = pd.read_csv("titanic_train.csv")
    # Get survivor data
    survivors = df[df["Survived"]==1]
    # Group survivor data per class
    grouped_survivors = survivors.groupby(["Pclass"])
    # Count number of survivors per class
    survivors_per_class = grouped_survivors.count()["Survived"]
    print(survivors_per_class)
    # Count number of people who didn't survive per class
    non_survivors_per_class = df[df["Survived"]==0].groupby("Pclass").count()["Survived"]
    # Count number of people per class
    total_per_class = df.groupby(["Pclass"])["Survived"].count()
    # Compute ratios of people who survived
    classes_num = len(survivors_per_class.index)
    def ratio_func(survivors_num, count):
        try:
            return survivors_num / count
        except ZeroDivisionError:
            return -1
    ratio_func_vector = np.vectorize(ratio_func)
    survivor_ratios = ratio_func_vector(survivors_per_class, total_per_class)
    non_survivor_ratios = ratio_func_vector(non_survivors_per_class, total_per_class)
    return np.flip(np.around(survivor_ratios, 3)), np.flip(np.around(non_survivor_ratios, 3))
                        
print(survived_within_class())

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64
(array([-1., -1., -1.]), array([-1., -1., -1.]))

C:\Users\trist\AppData\Local\Temp\ipykernel_15972\441227973.py:18: RuntimeWarning: divide by zero encountered in longlong_scalars
  return survivors_num / 0 #count

In [17]:
df = pd.read_csv("titanic_train.csv")
df.groupby(["Pclass"])["Survived"].count()

Pclass
1    216
2    184
3    491
Name: Survived, dtype: int64